request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://github.com/aokolnychyi/soap-tutorial">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequest>
            <name>Adrian</name>
        </gs:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>
